{
  "content": "\nFirst ever blog post on my first ever website!\n\nFor a bit of background, I'm a Research Software Engineer working in physics,\nwhich means things like C++, Fortran, and Python are my comfort zone. Ever since\nthe start of my career I've had a weird blind-spot for anything that touches the\nweb, and I figured now was the time to correct that. I'm currently subjecting\nmyself to a crash course in JavaScript and web-dev in general, and using this\nwebsite as a space to experiment and learn what I can.\n\nTo make the project more challenging and education, I set a few ground rules\nfor myself:\n\n- JavaScript all the way down.\n- No high-level frameworks to build the site from a pre-made template -- this is\n  a learning experience, so I need to understand what's happening under the hood.\n- It _must_ continue to work and look good on mobile.\n\nThe aim is to create something of a meta-portfolio: not only will the site\nhost my CV and blog, it will also serve as a demonstration of all the cool\nthings I've figured out in the field of web design.\n\n### The Core Stack\n\nAfter doing some initial digging I decided that I wanted the following stack:\n\n- [Yarn](https://yarnpkg.com/): Package manager.\n- [Vite](https://vite.dev/): Build tool.\n- [React](https://react.dev/): Core library/JSX language extension.\n- [Material UI](https://mui.com/): React UI tools.\n- [GitHub Pages](https://pages.github.com/): Hosting.\n\nAs far as I can tell, Yarn is somewhat similar to Hatch or Poetry in the Python\nworld, or perhaps Cargo for Rust. I'm not sufficiently well-versed in this\necosystem to say definitively that Yarn is better than using plain `npm`\neverywhere, but I certainly found it user-friendly and easy to get to grips\nwith!\n\nI was super-impressed with Vite; I used it to quickly set up a template\nrepository, and found it incredibly useful for rapid prototyping. I've been\nkeeping a spare terminal open running `yarn run vite` (mapped to `yarn dev`),\nwhich allows me to run a development build of the site in a web browser on my\nsecond screen.  Vite is incredibly responsive to changes in the repository --\nthe time between me saving a file and the website updating to account for it is\nalmost imperceptible.  Once I'm happy to deploy, I can then run `yarn build` and\n`yarn preview` to see what things will look like on GitHub pages (I caught a few\nbugs here, such as image files that weren't being distributed properly).\n\nReact is the core of the project, serving as the core front-end library in which\nI built most components of the website. The JSX language extension, which allows\nHTML-like syntactic sugar for building nested components, really smoothed out\nthe whole process, though I suspect I'll need some further practice with things\nlike `useState` and `useEffect` before they'll start feeling more natural.\n\nMaterial UI, or MUI for short, is a React-based framework that offers a large\nselection of pre-built user-interface components (lists, buttons, icons, menu\nbars, etc.). I imagine it would have taken ages to figure out how to build\nthings like that from scratch, and I could never have made things look so good.\nThe most powerful (yet most confusing) aspect MUI is the `sx` property on most\nof its items. This allows you to attach CSS properties to individual components,\ngiving you a lot of freedom to design things exactly how you want them. As a\nresult, there's a lot of code like this in my project:\n\n```jsx\n<Box\n  sx={{\n    width: '100%',            // Fill the screen or current container\n    maxWidth: '50em',         // ...but only up to a maximum width\n    display: 'flex',                  // Adjust sizes dynamically\n    justifyContent: 'space-between',  // Spread contents out to fill space\n    alignItems: 'center',             // ...but centre on the secondary axis\n    ml: {xs: 1, md: 3},       // Left margin 1 on small screens, 3 otherwise\n    mr: {xs: 1, md: 3},       // Similarly for right margin\n    mb: 2,                    // Bottom margin of 2\n  }}\n>\n   {/* whatever you want to put in the box! */}\n</Box>\n```\n\nI've been having some trouble wrapping my head around a lot of the `sx` options,\nand by extension CSS itself. I haven't yet developed an intuition for how options\nlike `justifyContent`, `alignItems`, `flexDirection`, `flexGrow` and\n`flexShrink` interact, so my solution has been to tinker until things work, save\nthe resulting object in a new React components called something like\n`<CentreBox\\>`, and then re-use it as much as I can. There are probably more\nthan a few redundant boxes scattered throughout the project because of an errant\n`flexDirection` that I got the wrong way around, and instead of fixing it\nproperly I just put another box inside of it.\n\nFinally, I chose GitHub Pages for hosting for a few reasons:\n\n1. It's free and I'm a cheapskate. \n1. It's really easy to get it set up.\n1. Did I mention it's free?\n\nI also know my way around GitHub Actions pretty well, so after a headstart\nwith Vite's docs, it was pretty straightforward to modify things so that\nthe project would test the build on pull requests but only deploy when\npushing to main.\n\n### Markdown and JSX\n\nAfter getting a front-page and my CV up and running, I decided to see if\nI could get a blog going. Things got a little tricky here for a few reasons:\n\n- GitHub Pages only allows static sites, so no dynamic data retrieval. The\n  blog posts must be integral to the project itself.\n- I could write a new JSX module for each new blog post, but that would\n  massively complicate the process, and it would be hard to enforce a\n  consistent style.\n- Something like Markdown would be nicer for writing pages, but JavaScript\n  doesn't support it by default.\n- I'll be writing a bunch of code in this blog, and I'll need to figure\n  out syntax highlighting if I want to have it look semi-decent.\n\nThe solution I came to has a few building blocks. First of all, the\nJavaScript library [`gray-matter`](`https://www.npmjs.com/package/gray-matter`)\ncan be used to bundle up Markdown files into JSON files, and also allows you to add\n_front-matter_. For example, the top of this file reads:\n\n```markdown\n---\ntitle: Hello, World!\nsubtitle: Making a personal website with React.\npublished: 2025-05-08\n---\n```\n\n`gray-matter` bundles this into a JSON object that looks like:\n\n```json\n{\n    \"data\": {\n        \"title\": \"Hello, World!\",\n        \"subtitle\": \"Making a personal website with React.\",\n        \"published\":\" 2025-05-08T00:00:00.000Z\"\n    },\n    \"content\": \"...the rest of the file...\"\n}\n```\n\nI added a short script that scans the directory `./blog` for Markdown files,\nwrites them in JSON format to a directory inside the project, and auto-generates\na `.jsx` file that imports each JSON and re-exports them in an array. I then set\nthings up in my `package.json` so I can update the blog from my Markdown files\njust by running `yarn blog`.\n\nWith the Markdown now accessible with self-describing tags in the JavaScript\nportion of the project, the next step was to render it into blog posts. I found\ntwo libraries to help with the process:\n\n- [`react-markdown`](https://www.npmjs.com/package/react-markdown)\n- [`react-syntax-highlighter`](https://www.npmjs.com/package/react-syntax-highlighter)\n\nIt's then remarkably easy to get things looking good. First I added this snippet\nthat takes the code portions of a Markdown file and applied syntax highlighting:\n\n```jsx\n// This is the highlighting engine itself.\nimport { Prism } from 'react-syntax-highlighter';\n// Choose a style for the highlighting.\n// Turns out they have my exact VSCode style!\nimport { xonokai } from 'react-syntax-highlighter/dist/esm/styles/prism';\n\nfunction highlight_syntax(props) {\n  const { children, className } = props;\n  // Read the language after the ```\n  const match = /language-(\\w+)/.exec(className || '');\n  // If a match is found, use Prism to do the highlighting.\n  // Otherwise, highlight with default colours.\n  return match ? (\n    <Prism language={match[1]} style={xonokai}>\n      {children}\n    </Prism>\n  ) : (\n    <code className={className}>{children}</code>\n  );\n}\n```\n\nYou can then render the blog post content with:\n\n```jsx\nimport Markdown from 'react-markdown';\nfunction make_blog_post(markdown){\n  // `markdown` is the object created by gray-matter\n  return (\n    <Markdown components={{ code: highlight_syntax }}>\n      {markdown.content}\n    </Markdown>\n  );\n}\n```\n\nWe're almost finished, but the routing was a bit of a challenge to figure out.\nI also needed to update the URL pathing for each new blog entry. The solution\nwas to return a `<Routes>` object from `react-router-dom`, and generate all\nof the pathing with a `.map(...)` call. Defining an object called `article`:\n\n```jsx\narticle = {\n    stem: \"2025-01-01-name-of-blog-post\",\n    markdown: markdown_2025_01_01_name_of_blog_post, // from gray-matter\n}\n```\n\nI found returning the following would automatically generate every blog\npost and get the routing right:\n\n```jsx\nfunction BlogPages() {\n  // BlogEntry is just something I made that gives you a\n  // pretty header and keeps the text in a nice box.\n  return (\n  return (\n    <Routes>\n      {articles.map((article, idx) => (\n        <Route\n          key={idx}\n          path={`${article.stem}`}\n          element={\n            <BlogEntry key={idx} {...article.markdown.data}>\n              <Markdown components={{ code: highlight_syntax }}>\n                {article.markdown.content}\n              </Markdown>\n            </BlogEntry>\n          }\n        />\n      ))}\n      <Route path=\"*\" element={<Error404 />} />\n    </Routes>\n  );\n}\n```\n\nThen, in `App.jsx`, I had to add the following to the top-level\nrouter:\n\n```jsx\n    <Route path=\"/blog\" element={<Blog />} />\n    <Route path=\"/blog/*\" element={<BlogPages />} />\n    <Route path=\"*\" element={<Error404 />} />\n```\n\nwhere `<Blog />` is the index page for the blog and `<Error404 />` is just a\npage telling the user they've got the wrong URL.\n\nI wish I could say, \"That's everything!\", but there are a few more details\nI had to figure out to get everything working nicely. Check out the files\n`scripts/update_blog.js` and everything under `src/pages/Blog.jsx` and\n`src/pages/Blog/` in the [source code](https://github.com/LiamPattinson/liampattinson.github.io)\nif you're interested.\n\n### Future Plans\n\nI already have a few ideas for how to improve things. It would be nice if this\nblog could have a sidebar to aid navigation once you're already in an article,\nbut I'm not sure how best to get that working on mobile, as then you would want\nit to disappear off the side of the screen until the user requested it. Some\nprevious/next buttons at the bottom would also be nice, and I haven't yet worked\nout a good way to get images in here.\n\nOn the site as a whole, I'd quite like to change the homepage to a personal\ndashboard. I imagine I could get pretty far just using public APIs, but for more\nspecialised data I might need to set up my own servers and a REST API. I've got\na couple of Raspberry Pis gathering dust at home, so that could be a fun hobby\nproject. I'd also like to add an image gallery for some other hobbies I have\ngoing on. MUI has some really nice utilities for arranging images on a page.\n\nFor blog posts, I've been wanting to write up my experience of Advent of Code\n2024 for a while now, plus I'd like to collect everything I've picked up about\nbonkers iterator chaining in Rust (honestly my favourite part of the language).\nI might also write up my Python development workflow at some point, as that\nmight be helpful to anybody who stumbles across this.\n",
  "data": {
    "title": "Hello, World!",
    "subtitle": "Making a personal website with React.",
    "published": "2025-05-08T00:00:00.000Z"
  },
  "isEmpty": false,
  "excerpt": ""
}
